'''
srs: 打印*组成的菱形三角形


   *
  ***
 *****
*******
 *****
  ***
   *

分析：
    分步思考拆解：
    菱形==一个正三角形+一个倒三角形

    1-一个正三角形
        1.1-空格三角形
        a -- 行  b -- 空格个数
        a = 1  b = 3
        a = 2  b = 2
        a = 3  b = 1
        a + b = 4  b = 4 - a

        1.2-* 三角形

        a -- 行  c -- *个数
        a = 1  c = 1
        a = 2  c = 3
        a = 3  c = 5
        a = 4  c = 7
        2a = c + 1 c = 2a-1

    2-一个倒三角形
        2.1-空格的循环
        a - 行  b - 空格

        2.2-*的循环

'''

#--------空格的循环
a = 1
while a < 5:

    #---控制空格的循环
    b = 0
    while b < 4-a:
        print(' ',end='')
        b += 1

    c = 1
    while c <= 2*a-1:
        print('*',end='')
        c += 1

    print()
    a += 1

#-------------


